package 정기역략평가01;

public class Exercise10 {
    // 10. 아래으 코드를 보고 물음에 답하시오
    // A = new Test() 와 B = new Test()가 같은가 다른가? 이유도 설명하시오


    // Answer :
    // 자바는 객체지향을 지원하는 프로그램이다. 그렇기 때문에 위의 두 객체는 같을 수도 있고 다를 수도 있다
    // 객체 지향 개념에서 다형성은 아주 큰 역할을 한다. 다형성이란 같은 자료형에 여러가지 객체를 대입하여 다른 결과 값을 얻을 수 있다는 뜻이다
    // 이 다형성을 구현 하는 것이 인터 페이스와 상속의 개념이다.
    // 부모 클래스의 메소드들이 자식 클래스를 참조하여 각각 변형을 하고 자식 클래스는 부모 클래스의 메소드를 사용한다.
    // 예를 들어 게임 리그 오브 레전드를 보자,
    // 리그 오브 레전드의 모든 캐릭의 스킬 키는 Q,W,E,R 로 입력이 된다 이것을 부모 클래스인것이다.
    // 그리고 각각의 캐릭터들이 다른 메서드를 넣어서 캐릭터만의 스킬을 구현한다.
    // 이렇듯 위의 코드는 자식 객체의 입력값들에 따라 달라 질 수도 같아 질 수도 있다.
}
